const Discord = require('discord.js');
const client = new Discord.Client();
const client2 = new Discord.Client();
const client3 = new Discord.Client();
const client4 = new Discord.Client();
const client5 = new Discord.Client();


let timer;

client.on('ready', () => {
   console.log(`----------------`);
   console.log(`Credit Farmm - Script By : SirBader. `);
   console.log(`----------------`);
   console.log(`Loadinng`);
   console.log(`Loadinng.`);
   console.log(`Loadinng..`);
   console.log(`Loadinng...`);
   console.log(`This Bots Online ' `);
   console.log(`----------------`);
});

client.on('message', message => {
    if(message.content === '-راتب'){
        message.channel.send('#daily')
    }
});

client.on('message', message => {
    if(message.content === '-مبلغ'){
        message.channel.send('#credits')
    }
});

client.on('message', message => {
    if(message.content === '-ريب'){
        message.channel.send('#rep <@476130473681092608>')
    }
});

client2.on('message', message => {
    if(message.content === '-راتب'){
        message.channel.send('#daily')
    }
});

client2.on('message', message => {
    if(message.content === '-مبلغ'){
        message.channel.send('#credits')
    }
});

client2.on('message', message => {
    if(message.content === '-ريب'){
        message.channel.send('#rep <@476130473681092608>')
    }
});

client3.on('message', message => {
    if(message.content === '-راتب'){
        message.channel.send('#daily')
    }
});

client3.on('message', message => {
    if(message.content === '-مبلغ'){
        message.channel.send('#credits')
    }
});

client3.on('message', message => {
    if(message.content === '-ريب'){
        message.channel.send('#rep ${member}')
    }
});

client4.on('message', message => {
    if(message.content === '-راتب'){
        message.channel.send('#daily')
    }
});

client4.on('message', message => {
    if(message.content === '-مبلغ'){
        message.channel.send('#credits')
    }
});

client4.on('message', message => {
    if(message.content === '-ريب'){
        message.channel.send('#rep ${member}')
    }
});

client5.on('message', message => {
    if(message.content === '-راتب'){
        message.channel.send('#daily')
    }
});

client5.on('message', message => {
    if(message.content === '-مبلغ'){
        message.channel.send('#credits')
    }
});

client5.on('message', message => {
    if(message.content === '-ريب'){
        message.channel.send('#rep ${member}')
    }
});


  client.on('ready', async () => {

      let ReBeL = ["Hiiiiبدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر iiiiiii","Looooبدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر ooool","frieenبدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر ds","badeeeeبدر  بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر er","Kiiiiiiبدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر iing","xDDDDDDDD"]

  setInterval(() => {

client.channels.get("506722849600569346").send(`${ReBeL[Math.floor(Math.random() *ReBeL.length)]}`);//لا تنسى تحط أيدي الروم

},2000);

});

  client2.on('ready', async () => {

      let ReBeL = ["Hiiiiبدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر iiiiiii","Looooبدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر ooool","frieenبدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر ds","badeeeeبدر  بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر er","Kiiiiiiبدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر iing","xDDDDDDDD"]

  setInterval(() => {

client.channels.get("506722849600569346").send(`${ReBeL[Math.floor(Math.random() *ReBeL.length)]}`);//لا تنسى تحط أيدي الروم

},2000);

});

  client3.on('ready', async () => {

      let ReBeL = ["Hiiiiبدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر iiiiiii","Looooبدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر ooool","frieenبدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر ds","badeeeeبدر  بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر er","Kiiiiiiبدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر iing","xDDDDDDDD"]

  setInterval(() => {

client.channels.get("506722849600569346").send(`${ReBeL[Math.floor(Math.random() *ReBeL.length)]}`);//لا تنسى تحط أيدي الروم

},2000);

});


  client4.on('ready', async () => {

      let ReBeL = ["Hiiiiبدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر iiiiiii","Looooبدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر ooool","frieenبدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر ds","badeeeeبدر  بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر er","Kiiiiiiبدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر iing","xDDDDDDDD"]

  setInterval(() => {

client.channels.get("506722849600569346").send(`${ReBeL[Math.floor(Math.random() *ReBeL.length)]}`);//لا تنسى تحط أيدي الروم

},2000);

});

  client5.on('ready', async () => {

      let ReBeL = ["Hiiiiبدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر iiiiiii","Looooبدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر ooool","frieenبدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر ds","badeeeeبدر  بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر er","Kiiiiiiبدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر بدر iing","xDDDDDDDD"]

  setInterval(() => {

client.channels.get("506722849600569346").send(`${ReBeL[Math.floor(Math.random() *ReBeL.length)]}`);//لا تنسى تحط أيدي الروم

},2000);

});


client.login(process.env.BOT_TOKEN);
client2.login(process.env.BOT_TOKEN2);// لا تغير فيها شيء
client3.login(process.env.BOT_TOKEN3);// لا تغير فيها شيء
client4.login(process.env.BOT_TOKEN4);// لا تغير فيها شيء
client5.login(process.env.BOT_TOKEN5);// لا تغير فيها شيء
